Tekla Open API Reference for Tekla Structures 2025
LinkBase.Attributes Property
 Gets or sets the link attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LinkAttributes Attributes { get; set; }
Public Property Attributes As LinkAttributes
	Get
	Set
Property Value
Type: LinkAttributes
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace